package main

import (
	"fmt"
	"sync"

	"github.com/karinaSelezneva/minipub/internal/broker"
)

func main() {
	b := broker.NewBroker()
	var wg sync.WaitGroup

	topic := "sport"
	ch := b.Subscribe(topic)

	wg.Add(1)

	go func() {
		defer wg.Done()

		// Читаем только 1 сообщение, чтобы тест завершился
		// Если нужен цикл for range, то брокер должен уметь закрывать каналы
		msg, ok := <-ch
		if ok {
			fmt.Printf("✅ Получено в main: %s\n", msg)
		}
	}()

	// Публикуем сообщение
	b.Publish(topic, "Привет из main!")

	// Ждем завершения горутины
	wg.Wait()

	fmt.Println("🚀 Все сообщения обработаны, выходим.")
}

// Тест в main.go:
// 1. В main создай брокер.
// 2. Подпишись на топик "news", получив канал.
// 3. Запусти горутину, которая читает из этого канала в бесконечном цикле и печатает текст.
// 4. Вызови Publish("news", "Hello Go!").
// 5. Бонусная подзадача: Попробуй сделать так, чтобы Publish запускал горутину на каждую отправку сообщения конкретному подписчику.
